'''
Функция top_grade()
Реализуйте функцию top_grade() c использованием аннотаций типов, которая принимает один аргумент:

grades — словарь, содержащий данные об ученике, а именно имя по ключу name и список оценок по ключу grades
Функция должна возвращать словарь, содержащий имя ученика по ключу name и его самую высокую оценку по ключу top_grade.

Примечание 1. Используйте встроенные типы (list, tuple, ...), а не типы из модуля typing. Также используйте нотацию |, а не тип Union из модуля typing.

Примечание 2. В возвращаемом функцией словаре сначала должно следовать имя, а затем — самая высокая оценка.

Примечание 3. В тестирующую систему сдайте программу, содержащую только необходимую функцию top_grade(), но не код, вызывающий ее.
'''


def top_grade(grades: dict[str, str | list[int]]) -> dict[str, str | int]:
    res = {'name': grades['name'], 'top_grade': max(grades['grades'])}
    return res


info = {'name': 'Timur', 'grades': [30, 57, 99]}

print(top_grade(info))